tasks/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "fold"], ["created_at", "2021-11-07 10:23:33.357898"], ["updated_at", "2021-11-07 10:23:33.357898"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save