auth/app/controllers/accounts_controller.rb

UPDATE "accounts" SET "role" = $1, "full_name" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["role", "admin"], ["full_name", ""], ["updated_at", "2021-11-06 14:13:20.385863"], ["id", 1]]
---
  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)